proveskit/circuitpython-pico2-sleep/ports/raspberrypi/boards/raspberry_pi_pico_w_slim/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Raspberry Pi Pico W Slim"
#define MICROPY_HW_MCU_NAME "rp2040"

#define CIRCUITPY_DIGITALIO_HAVE_INVALID_PULL (1)
#define CIRCUITPY_DIGITALIO_HAVE_INVALID_DRIVE_MODE (1)

#define MICROPY_HW_LED_STATUS   (&pin_CYW0)

#define CIRCUITPY_BOARD_I2C         (1)
#define CIRCUITPY_BOARD_I2C_PIN     {{.scl = &pin_GPIO5, .sda = &pin_GPIO4}}
